In [2]:
import pandas as pd

# question -1

In [3]:
p=pd.read_csv(r"C:\Users\ravim\Downloads\pddata.csv")
p

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

In [11]:
p.head(6)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

# question-2

In [15]:
x=p.head(6)
for i in x:
    print(i) ## 1st method

PID
STATE
PRICE
NUM_BEDROOMS
NUM_BATH
SQ_FT

In [16]:
p.columns.tolist() ## 2nd method

['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT']

In [12]:
x=p.index
for i in x:
    print(i) ## 1st method

0
1
2
3
4
5
6
7
8

In [13]:
p.index.tolist() ## 2nd method

[0, 1, 2, 3, 4, 5, 6, 7, 8]

# question -3

In [18]:
p.shape

(9, 6)

In [19]:
p.drop_duplicates().shape[0]

9

In [31]:
p['STATE'].unique()

array(['MP', 'MAHARASHTRA', 'AP', 'TN', 'ASSAM', 'HP'], dtype=object)

# question -4

In [36]:
null=p.isnull()
print(null)

     PID  STATE  PRICE  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False  False  False         False     False  False
1  False  False  False         False     False  False
2  False  False  False          True     False  False
3  False  False  False         False      True  False
4   True  False  False         False     False  False
5  False  False  False          True     False  False
6  False  False  False         False     False  False
7  False  False  False         False     False   True
8  False  False  False         False     False  False

In [42]:
p.loc[[0,1,2,3,4,5,6,7,8],'NUM_BEDROOMS']=['na','na','na','na','na','na','na','na','na']
p

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654           na        1  1000
1  100002000.0  MAHARASHTRA      21325           na      1.5    --
2  100003000.0           AP    2541654           na        1   850
3  100004000.0           TN     321321           na      NaN   700
4          NaN           TN  589465645           na        2  1600
5  100006000.0           TN   65465466           na        1   800
6  100007000.0        ASSAM    3222321           na   HURLEY   950
7  100008000.0           HP      23131           na        1   NaN
8  100009000.0           HP      21212           na        2  1800

# question -6

In [4]:
p.loc[[3,6,],'NUM_BATH']=[1,1]
p

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1        1   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2        1   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

# question -7

In [4]:
p['SQ_FT']=pd.to_numeric(p['SQ_FT'],errors='coerce')
x=p['SQ_FT'].mean()
x
p['SQ_FT'].fillna(x)

0    1000.0
1    1100.0
2     850.0
3     700.0
4    1600.0
5     800.0
6     950.0
7    1100.0
8    1800.0
Name: SQ_FT, dtype: float64

# question -8

In [6]:
p['SQ_FT']=pd.to_numeric(p['SQ_FT'],errors='coerce')
x=p['SQ_FT'].sum()
x

7700.0